Revit 2026 API
AnalyticalElement.GetCurve Method
 Returns the curve of the Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Curve GetCurve()
Public Function GetCurve As Curve
public:
Curve^ GetCurve()
member GetCurve : unit -> Curve
Return Value
Curve
 The curve of the Analytical Element.
Exceptions
Exception | Condition
InapplicableDataException |  This AnalyticalElement contains more than one single curve.
Remarks
 If the Analytical Element cannot be expressed as a single curve, an exception is thrown.
See Also
Reference
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace